tuanchris/dune-weaver-touch/sdkconfig.defaults
# Target / clocks
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# Flash: 16MB quad (eFuse says quad, not octal)
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# PSRAM: 8MB octal (AP_3v3)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
# 0 = every plain malloc prefers PSRAM (internal only as fallback, and never
# below the reserve). With the old 4096, the LVGL widget tree + cJSON parse
# of a 1200-pattern table exhausted internal RAM to <1 KB free and the WiFi
# driver storm-failed beacon buffers ("wifi:m f null") — measured 2026-08-25,
# heap heartbeat in main.c. WiFi/DMA allocs are caps-explicit and unaffected.
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=0
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=65536

# Required for RGB-panel DMA out of PSRAM
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
# XIP from PSRAM: flash ops (NVS, LittleFS) must not disable the cache while
# the bounce-buffer ISR streams the PSRAM framebuffer, or the panel ISR
# cache-faults (Guru Meditation during any nvs/littlefs write).
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_LCD_RGB_ISR_IRAM_SAFE=y
CONFIG_GDMA_CTRL_FUNC_IN_IRAM=y
CONFIG_GDMA_ISR_IRAM_SAFE=y

# Console over native USB (UART0 pins 43/44 drive the RS485 transceiver)
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

CONFIG_FREERTOS_HZ=1000

# Pattern TF card: FAT long filenames ("patterns.json", "<name>.thr.bin")
CONFIG_FATFS_LFN_HEAP=y


# Precise stack-overflow faults instead of silent memory corruption
CONFIG_FREERTOS_WATCHPOINT_END_OF_STACK=y

# LVGL 9 (configured via Kconfig, no lv_conf.h)
CONFIG_LV_CONF_SKIP=y
CONFIG_LV_COLOR_DEPTH_16=y
# ESP heap instead of LVGL's 64KB builtin pool: the five-page widget tree
# exceeds it, and the builtin OOM assert spins in while(1) at boot.
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_USE_CLIB_STRING=y
CONFIG_LV_USE_CLIB_SPRINTF=y
# Let malloc overflow into PSRAM once internal RAM runs low
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_22=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_26=y
CONFIG_LV_FONT_MONTSERRAT_36=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_32=y
CONFIG_LV_FONT_MONTSERRAT_40=y
CONFIG_LV_FONT_MONTSERRAT_48=y

# OTA (2026-08-27). The bootloader marks a freshly flashed image
# PENDING_VERIFY and reverts to the previous slot on the next reset unless the
# app calls esp_ota_mark_app_valid_cancel_rollback() -- ota_mark_valid() does
# that at the end of app_main, so an image that panics during init undoes
# itself instead of bricking the panel's only UI.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
